add architecture diagrams
